# Домашние задания. Контесты

* Домашнее задание нужно в первую очередь для того, чтобы освоить язык.
* Домашнее задание — не соревнование. Если какая-то задача не получается, всегда можно обсудить её в чатике.

## Правила оформления решений

По-умолчанию везде считается, что:
1. программа читает данные со стандартного ввода и выводит результат в стандартный вывод;
2. все входные данные корректны.

Если требуется считать одну строку, то это можно сделать так:
```python
line = input()
```
или так:
```python
import sys
line = sys.stdin.readline()
```

Если требуется считать все строки из стандатрного потока ввода, то это можно сделать так:
```python
import sys

for line in sys.stdin:
    # делаем со строкой всё, что нужно
```

Почти во всех заданиях требуется написать программу-модуль, т.е. предполагается импортировать ваше решение и использовать определенные в нём объекты (функции, классы и т.п.). Верным индикатором такого задания является требование как-то по особому назвать свой объект.

Решение таких задач должно иметь следующий формат:
```python
# объявление требуемых объектов

if __name__ == "__main__":
    # чтение со стандартного ввода, печать результатов
```

В некоторых заданиях в качестве примеров входных данных приведены кусочки кода, иллюстрирующие работу и способы взаимодействия с функциями и классами. В этих задачах в блоке `main` вы можете тестировать свою программу.

### Пример оформления решения

**Задание:** напишите функцию `add(a, b)`, которая суммирует два числа.

**Решение:**
```python
def add(a, b):
    return a + b

if __name__ == "__main__":
    a, b = input().split()
    a, b = int(a), int(b)
    print(add(a, b))
```
